// {
//   "e": "kline",
//   "E": 1697288658673,
//   "s": "BTCUSDT",
//   "k": {
//     "t": 1696809600000,
//     "T": 1697414399999,
//     "s": "BTCUSDT",
//     "i": "1h",
//     "f": 69915457,
//     "L": 69937421,
//     "o": "0.00000316",
//     "c": "0.00000317",
//     "h": "0.00000324",
//     "l": "0.00000311",
//     "v": "65229990.00000000",
//     "n": 21965,
//     "x": false,
//     "q": "206.97094079",
//     "V": "32330456.00000000",
//     "Q": "102.73648818",
//     "B": "0"
//   }
// }

{
  "_id": "ObjectId('65ac6cc3c3731323ffcab8d4')",
  "event_time": 1705795200000,
  "message": "Trong giờ qua, giá các cặp mã tiền ảo... đã có những biến động nhất định. Đầu tiên, giá DOGEUSDT đã tăng 1.8% từ 0.08777 lên 0.08935. Trong khoảng thời gian từ 0:45 đến 0:46, DOGEUSDT tiếp tục tăng 0.46% với volume trung bình cao nhất đạt 3896007.0/phút. Tuy nhiên, từ 0:51 đến 0:58, DOGEUSDT đã giảm 0.8% với volume trung bình cao nhất là 4113810.6/phút.\n\nTrong khi đó, giá BTCUSDT đã giảm 0.12% từ 41696.05 xuống 41645.98 trong giờ qua. Tương tự, giá ETHUSDT cũng giảm 0.25% từ 2472.02 xuống 2465.78. Giá SHIBUSDT cũng không ngoại lệ khi giảm 0.31% từ 9.68e-06 xuống 9.65e-06 trong khoảng thời gian tương tự. Tuy nhiên, từ 0:45 đến 0:46, SHIBUSDT đã tăng 0.31% với volume trung bình cao nhất đạt 3100387126.0/phút. Nhưng từ 0:50 đến 0:57, giá SHIBUSDT lại giảm 0.31% với volume trung bình cao nhất là 2609441523.83/phút.\n\nTrong khi đó, giá BNBUSDT đã tăng 0.13% từ 317.3 lên 317.7 trong giờ qua. Tuy nhiên, giá XRPUSDT đã giảm 0.16% từ 0.5534 xuống 0.5525. Giá SOLUSDT cũng không có sự thay đổi tích cực khi giảm 0.8% từ 92.88 xuống 92.14. Cuối cùng, giá ADAUSDT cũng giảm 0.43% từ 0.5159 xuống 0.5137 trong giờ qua. Tuy nhiên, từ 0:45 đến 0:49, ADAUSDT đã tăng 0.35% với volume trung bình cao nhất đạt 19159.58/phút. Nhưng từ 0:49 đến 0:59, giá ADAUSDT lại giảm 0.58% với volume trung bình cao nhất là 60380.71/phút.\n\nTổng kết, trong giờ qua, giá các cặp mã tiền ảo đã có những biến động khác nhau. Một số cặp mã tiền ảo như DOGEUSDT và BNBUSDT đã có sự tăng giá nhỏ, trong khi các cặp mã tiền ảo khác như BTCUSDT, ETHUSDT, SHIBUSDT, XRPUSDT, SOLUSDT và ADAUSDT đã giảm giá. Các biến động này cho thấy tình hình tiền ảo vẫn đang diễn ra một cách không ổn định và cần được theo dõi thêm trong thời gian tới."
}

{
  _id: ObjectId('65ac6c90c3731323ffcab8d1'),
  event_time: 1705795200000,
  open: 41696.05,
  high: 41727,
  low: 41629.87,
  close: 41645.98,
  volume: 405.51248
}